// =========================================================
// ARENA "THE CUBE" — 夜空に浮かぶキューブ型スタジアム
//  内側 26 × 18 × 26。チーム A は -X 側、B は +X 側から出撃。
//  ブロックは中心に対して 180° 回転対称(公平)。
// =========================================================
export default {
  id: 'cube',
  name: { ja: 'ザ・キューブ', en: 'THE CUBE' },
  size: [26, 18, 26],
  colors: {
    floorWall: { x: '#262b42', y: '#232838', z: '#22283f' }, // 各軸の min 側の面
    ceilWall: { x: '#262b42', y: '#1b1f30', z: '#22283f' },  // 各軸の max 側の面
    block: '#30375a',
    grid: '#5560ff',
    edge: '#8fe8ff',
  },
  blocks: [
    { min: [-3, 7, -3], max: [3, 10, 3], color: '#353d66' },     // 中央の浮島
    { min: [-8, 3, -8], max: [-5, 6, -5] },
    { min: [5, 3, 5], max: [8, 6, 8] },
    { min: [-8, 12, 5], max: [-5, 15, 8] },
    { min: [5, 12, -8], max: [8, 15, -5] },
    { min: [-7, 0, -2], max: [-6, 2, 2], color: '#2c3354' },     // 出撃地点の前の低い壁
    { min: [6, 0, -2], max: [7, 2, 2], color: '#2c3354' },
    { min: [-2, 6, -13], max: [2, 7, -11] },                     // 壁から張り出した足場
    { min: [-2, 11, 11], max: [2, 12, 13] },
  ],
  spawns: {
    A: [[-9.5, 0.5, -4.5], [-9.5, 0.5, -1.5], [-9.5, 0.5, 1.5], [-9.5, 0.5, 4.5]],
    B: [[9.5, 0.5, 4.5], [9.5, 0.5, 1.5], [9.5, 0.5, -1.5], [9.5, 0.5, -4.5]],
  },
  // ばくだん鬼(個人戦)の出撃地点:床と天井のあちこち
  ffaSpawns: [
    [-10, 0.5, -10, 'down'], [10, 0.5, 10, 'down'], [-10, 0.5, 10, 'down'], [10, 0.5, -10, 'down'],
    [0, 17.5, -10, 'up'], [0, 17.5, 10, 'up'], [-10, 17.5, 0, 'up'], [10, 17.5, 0, 'up'],
  ],
  spawnFacing: { A: [1, 0, 0], B: [-1, 0, 0] },
};
